/*
    1. По координатам двух точек, которые вводит пользователь, определить уравнение прямой, проходящей через эти точки.
    Общий вид уравнения: y = kx + b; где k = (y1 - y2) / (x1 - x2), b = y2 - k*x2.
*/

[a,b]=prompt('Введіть 2 цілих числа через пробіл, це перша точка.','Вводити тут').split(' ');
console.log(a, b);// - вывод данных в консоль браузера
document.write("Координати першої точки : " + '(' + a + ', ' + b + ')' + '<br/>');
[q,w]=prompt('Введіть 2 цілих числа через пробіл, це друга точка.','Вводити тут').split(' ');
console.log(q, w);// - вывод данных в консоль браузера
document.write("Координати другої точки : " + '(' + q + ', ' + w +  ')' + '<br/>');
function countRiv() {
    let kKoe = (b - w) / (a - q);
    let bKoe = w - kKoe * q;
    alert("Рівняння " + 'y = ' + kKoe + '*x + ' + bKoe);
}
countRiv()