/* 
4. Для предыдущего задания создайте функцию, которая будет принимать в себя массив объектов-сотрудников, и каждому из объектов
будет добавлять новое свойство "salary", хранящее зарплату сотрудника. 
Зарплата расчитывается, исходя из значения свойства "occupation" следующим образом:
    • "director" — 3000;
    • "manager" — 1500;
    • "programmer" — 2000;
    • для остальных значений — 1000.
После выполнения функции — вывести информацию о сотрудниках.
    
// sort(function(a, b) { return a > b });
// 1, 2, 3, 5, 10, 14
// 1, 10, 14, 2, 3,
*/

